In [1]:
import os
os.chdir("../")

In [2]:
from comchoice.voting import Voting
import pandas as pd
import numpy as np
from itertools import combinations

In [34]:
# data = [
#    {"voters": 7, "rank": "A>B>C>D"},
#    {"voters": 5, "rank": "B>C>D>A"},
#    {"voters": 6, "rank": "D>B>C>A"},
#    {"voters": 4, "rank": "C>D>A>B"}
# ]

# data = [
#     {"voters": 5, "rank": "A>C>B>E>D"},
#     {"voters": 5, "rank": "A>D>E>C>B"},
#     {"voters": 8, "rank": "B>E>D>A>C"},
#     {"voters": 3, "rank": "C>A>B>E>D"},
#     {"voters": 7, "rank": "C>A>E>B>D"},
#     {"voters": 2, "rank": "C>B>A>D>E"},
#     {"voters": 7, "rank": "D>C>E>B>A"},
#     {"voters": 8, "rank": "E>B>A>D>C"}
# ]

data = [
    {"voters": 19, "rank": "A>B>C>D>E>F"},
    {"voters": 12, "rank": "F>A>B>C>D>E"},
    {"voters": 12, "rank": "E>D>C>B>F>A"},
    {"voters": 9, "rank": "B>A>C>D>E>F"},
    {"voters": 9, "rank": "F>E>D>C>B>A"},
    {"voters": 10, "rank": "F>B>A>C>D>E"},
    {"voters": 10, "rank": "E>D>C>A>F>B"},
    {"voters": 10, "rank": "E>B>A>C>D>F"},
    {"voters": 10, "rank": "F>D>C>A>E>B"},
    {"voters": 10, "rank": "D>B>A>C>E>F"},
    {"voters": 10, "rank": "F>E>C>A>D>B"},
]

df = pd.DataFrame(data)
df

    voters         rank
0       19  A>B>C>D>E>F
1       12  F>A>B>C>D>E
2       12  E>D>C>B>F>A
3        9  B>A>C>D>E>F
4        9  F>E>D>C>B>A
5       10  F>B>A>C>D>E
6       10  E>D>C>A>F>B
7       10  E>B>A>C>D>F
8       10  F>D>C>A>E>B
9       10  D>B>A>C>E>F
10      10  F>E>C>A>D>B

In [4]:
choice = Voting(data)

In [ ]:
choice.separator = ","

In [5]:
choice.dodgson_quick()

  _loser  value  rank
0      A    3.0     1
1      B    4.0     2
2      C   20.0     3
3      D   20.0     3
4      E   30.0     5
5      F   30.0     5

In [6]:
choice.tideman()

  _loser  value  rank
1      B    4.0     1
0      A    5.0     2
2      C   38.0     3
3      D   38.0     3
4      E   57.0     5
5      F   57.0     5

In [33]:
 # worst pairwise defeat (margins) (Min)
    
choice.minimax(method="pairwise_opposition")

  alternative     value
0         B  0.504132

In [32]:
help(choice.minimax)

Help on method minimax in module comchoice.voting:

minimax(method='winning_votes') method of comchoice.voting.Voting instance

In [8]:
choice.schulze()

  alternative  value  rank
1         B      5     1
0         A      4     2
2         C      3     3
3         D      2     4
4         E      1     5
5         F      0     6

In [9]:
choice.antiplurality()

  alternative  value  rank
1         B      9     1
2         D     10     2
0         A     19     3
3         E     32     4
4         F     51     5

In [10]:
choice.black()

  alternative  value  rank
0         A    329     1

In [11]:
choice.nanson_baldwin("baldwin")

  alternative  value  rank
0         A      0     1

In [12]:
choice.borda()

  alternative  value  rank
0         A    329     1
2         C    312     2
1         B    310     3
3         D    303     4
4         E    284     5
5         F    277     6

In [13]:
choice.compare_methods(rules=["borda", "copeland", "plurality"])#.corr("kendall")

  alternative  borda  copeland  plurality
0         A      1         1          3
1         B      3         6          5
2         D      4         2          4
3         E      5         4          2
4         F      6         4          1

In [14]:
choice.completeness()

True

In [15]:
# TODO
choice.condorcet()

  alternative  value
0         A    0.8

In [16]:
# TODO
choice.copeland()

  alternative  value  rank
0         A    0.8     1
2         C    0.6     2
3         D    0.6     2
4         E    0.4     4
5         F    0.4     4
1         B    0.2     6

In [17]:
# TODO
# choice.cumulative()

In [18]:
choice.hare()

  alternative     value
0         F  0.520661

In [19]:
choice.k_approval(k=1)

  alternative  value  rank
5         F     51     1
4         E     32     2
0         A     19     3
3         D     10     4
1         B      9     5
2         C      0     6

In [20]:
choice.kemeny_young()

  alternative  rank
0         A     1
1         B     2
2         C     3
3         D     4
4         E     5
5         F     6

In [21]:
# TODO
# choice.negative()

In [22]:
choice.plurality()

  alternative  value  rank
4         F     51     1
3         E     32     2
0         A     19     3
2         D     10     4
1         B      9     5

In [23]:
# TODO
# choice.score()

In [24]:
choice.smith_set()

['A', 'C', 'D', 'E', 'F']

In [25]:
choice.dowdall()

  alternative      value  rank
5         F  63.400000     1
4         E  54.766667     2
0         A  50.500000     3
1         B  47.300000     4
3         D  44.400000     5
2         C  36.083333     6

In [26]:
choice.ranking(method="plurality")

  alternative  value  rank
4         F     51     1
3         E     32     2
0         A     19     3
2         D     10     4
1         B      9     5

In [27]:
pp = choice.ranking(method="plurality")

pp["rank"] = pp["value"].rank(method="min", ascending=False).astype(int)
pp

  alternative  value  rank
4         F     51     1
3         E     32     2
0         A     19     3
2         D     10     4
1         B      9     5

In [28]:
choice.winner(method="plurality")

  alternative  value  rank
0         F     51     1

In [29]:
choice.loser(method="plurality")

  alternative  value  rank
0         B      9     5